
[
  {
    "@context": "https://schema.org",
    "@type": "Book",
    "datePublished": "2008-09-14",
    "description": "En una oscura version del futuro proximo, doce chicos y doce chicas se ven obligados a participar en un reality show llamado Los Juegos del Hambre. Solo hay una regla: matar o morir.",
    "genre": "fictional",
    "author": "Suzanne Collins",
    "inLanguage": "es-ES",
    "isbn": "9788427202122",
    "name": "Los juegos del hambre",
    "numberOfPages": "374",
    "publisher": {
      "@type": "Organization",
      "name": "Scholastic"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/hambre.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Carlos",
        "comment": "Es un gran libro que coge su inspiracion de los Juegos del Hambre del videojuego Minecraft.",
        "date": "2019/4/20"
      },
      {
        "nickname": "Lluc",
        "comment": "El mejor libro que he leido nunca, se lo recomendaria a cualquiera.",
        "date": "2012/03/11"
      }
    ]
  },
  {
    "@context": "https://schema.org",
    "@type": "Book",
    "datePublished": "2006-04-21",
    "description": "Durante mil anyos han caido cenizas del cielo. Durante mil anyos nada ha florecido. Durante mil anyos los skaa han sido esclavizados y viven en la miseria, sumidos en un miedo inevitable. Durante mil anyos el Lord Legislador ha reinado con poder absoluto, dominando gracias al terror, a sus poderes y a su inmortalidad, ayudado por obligadores e inquisidores, junto a la poderosa magia de la alomancia.",
    "genre": "Fantasy",
    "author": "Brandon Sanderson",
    "inLanguage": "es-ES",
    "isbn": "9788417347291",
    "name": "El imperio final",
    "numberOfPages": "688",
    "publisher": {
      "@type": "Organization",
      "name": "Tor Books"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/lib1.png"
      }
    ],
    "contadores": {
      "favorito": "true"
    },
    "coments": [
      {
        "nickname": "Esteve",
        "comment": "Este libro es increible, me ha hecho sentir como que volvia a ser ninyo.",
        "date": "2007/01/12"
      },
      {
        "nickname": "Francisco Javier",
        "comment": "Sigo sin entender la pasion de la gente por Brandon Sanderson, pero este libro no esta mal.",
        "date": "2008/03/21"
      }
    ]
  },
  {
    "@context": "https://schema.org",
    "@type": "Book",
    "datePublished": "2010-08-31",
    "description": "Los dias en que los Heraldos nos abandonaron y los Caballeros Radiantes se giraron en nuestra contra. Un tiempo en que aun habia magia en el mundo y honor en el corazon de los hombres. El mundo fue nuestro, pero lo perdimos. Probablemente no hay nada mas estimulante para las almas de los hombres que la victoria.",
    "genre": "Fantasy",
    "author": "Brandon Sanderson",
    "inLanguage": "es-ES",
    "isbn": "9788466657662",
    "name": "El camino de los reyes",
    "numberOfPages": "1007",
    "publisher": {
      "@type": "Organization",
      "name": "Tor Books"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/cam.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Juan",
        "comment": "Desde el balcon: *Sonidos de caballo.",
        "date": "2022/03/09"
      },
      {
        "nickname": "Ander Salmon",
        "comment": "No hay mejor autor que Sanderson, lo recomiendo alli donde voy.",
        "date": "2021/04/19"
      }
    ]
  },
    {
    "@context": "https://schema.org",
    "@type": "Book",
    "datePublished": "2012-03-6",
    "description": "Jack , un joven artista, gana en una partida de cartas un pasaje para viajar a América en el Titanic, el transatlántico más grande y seguro jamás construido. A bordo conoce a Rose, una joven de una buena familia venida a menos que va a contraer un matrimonio de conveniencia con Cal, un millonario engreído a quien sólo interesa el prestigioso apellido de su prometida. Jack y Rose se enamoran, pero el prometido y la madre de ella ponen todo tipo de trabas a su relación. Mientras, el gigantesco y lujoso transatlántico se aproxima hacia un inmenso iceberg.",
    "genre": "Drama",
    "author": "Ed W. Marsh",
    "inLanguage": "en-GB",
    "isbn": "9780062119384",
    "name": "Titanic",
    "numberOfPages": "208",
    "publisher": {
      "@type": "Organization",
      "name": "Harper Design"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/titanic.jpg"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Rodrigo",
        "comment": "En el cine será un clásico pero ha sido lo peor que he leído en mucho tiempo.",
        "date": "2020/04/03"
      },
      {
        "nickname": "Carlos",
        "comment": "Buen libro.",
        "date": "2021/04/19"
      }
    ]
  },
  {
    "@context": "https://schema.org",
    "@type": "Book",
    "datePublished": "2012-03-6",
    "description": "Harry Potter nunca ha oído hablar de Hogwarts hasta que empiezan a caer cartas en el felpudo del número 4 de Privet Drive. Llevan la dirección escrita con tinta verde en un sobre de pergamino amarillento con un sello de lacre púrpura, y sus horripilantes tíos se apresuran a confiscarlas. Más tarde, el día que Harry cumple once años, Rubeus Hagrid, un hombre gigantesco cuyos ojos brillan como escarabajos negros, irrumpe con una noticia extraordinaria: Harry Potter es un mago, y le han concedido una plaza en el Colegio Hogwarts de Magia y Hechicería. ¡Está a punto de comenzar una aventura increíble!.",
    "genre": "Fantasia",
    "author": "J.K. Rowling",
    "inLanguage": "en-ES",
    "isbn": "9788478884452",
    "name": "Harry Potter",
    "numberOfPages": "256",
    "publisher": {
      "@type": "Organization",
      "name": "Salamandra"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/harrypotter.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Miquella",
        "comment": "Mi hermana me dejo con este libro junto a un árbol y me imaginaba miles de cosas a su lado.",
        "date": "2022/03/03"
      },
      {
        "nickname": "Malenia",
        "comment": "Es increible que la piedra filosofal tenga tanto sentido en la historia, no te lo ves venir, es un libro lleno de giros.",
        "date": "2022/03/19"
      }
    ]
  },
  {
    "@context": "https://schema.org",
    "@type": "Book",
    "datePublished": "2021-05-6",
    "description": "Este libro único recoge una vasta gama de imágenes e información sobre gran número de personajes, criaturas, vehículos, aparatos y lugares, presentados en orden cronológico desde su primera aparición en las películas de Star Wars hasta las secuelas Star Wars: Las guerras clon, Star Wars Rebels y otros contenidos de la saga. Si eres fan de Star Wars no tendrás ningún problema en encontrar aquí lo que buscas. Y si eres nuevo en la galaxia, te animamos a que tengas Universo Star Wars siempre a mano cuando veas las películas de Star Wars.",
    "genre": "Ciencia ficción",
    "author": "Lucasfilm Ltd",
    "inLanguage": "en-ES",
    "isbn": "9780241420584",
    "name": "Star Wars",
    "numberOfPages": "352",
    "publisher": {
      "@type": "Organization",
      "name": "DK"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/starwars.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Brandon S",
        "comment": "Muy buen libro, ilustra muy bien a los persoanejes y les da profundidad que les faltaba a les peliculas.",
        "date": "2021/03/07"
      },
      {
        "nickname": "Francisco",
        "comment": "No era lo que esperaba, pero estoy satisfecho.",
        "date": "2021/08/21"
      }
    ]
  },
  {
    "@type": "Book",
    "datePublished": "2020-09-17",
    "description": "¡La saga que reúne a todos los Hombres Araña y Mujeres Araña que han existido jamás. Dan Slott (El Asombroso Spiderman) y Olivier Coipel (Dinastía de M) se unen para ofrecerte el mayor evento en la historia de Spiderman. Más peligroso que nunca, Morlun amenaza a todos los Hombres Araña que existen en el Multiverso, pero esta vez no está solo: tiene a la familia a su lado. ¡Todos los Spiderman que han existido están en peligro.",
    "genre": "Superheroes",
    "author": "Coipel Olivier",
    "inLanguage": "en-ES",
    "isbn": "9788413344294",
    "name": "Spider Man",
    "numberOfPages": "176",
    "publisher": {
      "@type": "Organization",
      "name": "Panini Comics"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/spiderman.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Peter Parker",
        "comment": "Ojala ser Spiderman, tiene pinta de ser muy buena persona, me encantaría conocerlo.",
        "date": "2020/09/20"
      },
      {
        "nickname": "Evelyn",
        "comment": "La mujer con el traje de Spiderman negra me ha encantado la verdad, al igual le hago un homenaje.",
        "date": "2020/09/22"
      }
    ]
  },
  {
    "@type": "Book",
    "datePublished": "2022-11-21",
    "description": "Durante más de 500 años, Roma fue la más poderosa y avanzada civilización que el mundo había conocido jamás. El Imperio romano llegó a abarcar tres continentes y su enorme influencia sentó las bases de nuestra civilización, en la que todavía perdura un impresionante legado presente en la lengua, el derecho y la cultura occidentales.",
    "genre": "Historia",
    "author": "NATGEO HISTORIA",
    "inLanguage": "en-ES",
    "isbn": "9788482988795",
    "name": "El imperio romano",
    "numberOfPages": "448",
    "publisher": {
      "@type": "Organization",
      "name": "National Geographic"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/imperioromano.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Eldelgard Von Hresvelg",
        "comment": "Me ha gustado la parte donde explican como se formo el imperio, tomaré notas de ellos, muy buen libro 10/10.",
        "date": "2022-12-03"
      },
      {
        "nickname": "Hubert von Vestra",
        "comment": "Lo leo para tener idea de liderato y mejorar mis capacidades para conocer la historia, ha sido muy útil.",
        "date": "2022-11-28"
      }
    ]
  },
  {
    "@type": "Book",
    "datePublished": "2015-04-01",
    "description": "Pájaro Amarillo es un cuento sobre el valor de compartir. Nos invita a cuidar el planeta en el que vivimos y a liberar nuestras ideas por el bien común.",
    "genre": "Cuento para niños",
    "author": "Olga de Dios Ruiz",
    "inLanguage": "en-ES",
    "isbn": "9788494347603",
    "name": "Pajaro Amarillo",
    "numberOfPages": "40",
    "publisher": {
      "@type": "Organization",
      "name": "Apila"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/pajaroamarillo.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Annie",
        "comment": "Es un buen libro para leer antes de ir a dormir con mi osito.",
        "date": "2020/09/20"
      },
      {
        "nickname": "Anya",
        "comment": "Chichi me lo lee cada noche antes de irme a la cama, me encanta.",
        "date": "2020/09/22"
      }
    ]
  },
  {
    "@type": "Book",
    "datePublished": "2020-10-06",
    "description": "Durante la noche del 24 al 25 de julio de 1938, la XI Brigada Mixta del ejército de la República cruza el río para establecer una cabeza de puente en Castellets del Segre. En las inmediaciones del pueblo, medio batallón de infantería, un tabor marroquí y una compañía de la Legión defienden la zona. Está a punto de comenzar la batalla del Ebro, la más cruda y sangrienta que se libró nunca en suelo español.",
    "genre": "Historia",
    "author": "Arturo Pérez-Reverte",
    "inLanguage": "en-ES",
    "isbn": "9788420454665",
    "name": "Línea de fuego",
    "numberOfPages": "688",
    "publisher": {
      "@type": "Organization",
      "name": "ALFAGUARA"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/lineadefuego.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Jose Manuel Martinez",
        "comment": "Me ha encantado lo bien que plasma la historia de sus personajes, uno de mis favoritos sin duda.",
        "date": "2020/10/20"
      },
      {
        "nickname": "Javier Inmaculado",
        "comment": "Este libro es fantastico, se lo recomiendo a todas las personas para que tengan un poco de cultura y dejen de votar a según que personas.",
        "date": "2020/10/23"
      }
    ]
  },
  {
    "datePublished": "2021-10-20",
    "description": "V de vendetta es uno de los trabajos más personales y logradas de sus autores: Alan Moore (Watchmen, Batman: La broma asesina) y David Lloyd (Hellblazer). Con esta esperada nueva edición, volveremos a disfrutar de la historia protagonizada por el subversivo V, ahora en formato cartoné y con abundante material extra, V de Vendetta, además de ser una de las mayores obras maestras de la industria del cómic y una de las obras más personales de sus autores, Alan Moore y David Lloyd, es una historia espeluznante y terriblemente real acerca de la pérdida de la libertad y de la identidad del individuo que se ve inmerso en un mundo hostil, frío y totalitario. Con el trasfondo de una Inglaterra imaginaria que ha caído bajo la bota de un régimen fascista, se analiza tanto la vida bajo un estado policial asfixiante como el poder de la rebelión y la resistencia del espíritu humano ante la opresión y el totalitarismo.",
    "genre": "Acción",
    "author": "Alan Moore",
    "inLanguage": "en-ES",
    "isbn": "9788420454665",
    "name": "V de Vendetta",
    "numberOfPages": "288",
    "publisher": {
      "@type": "Organization",
      "name": "ALFAGUARA"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/vdevendetta.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Kamisato Ayaka",
        "comment": "Este libro explica muy bien como empiezan las revoluciones, primero desde las sombras y luego van emergiendo, me ha gustado mucho.",
        "date": "2020/10/22"
      },
      {
        "nickname": "Sara",
        "comment": "Este tipo de libros no deberían estar permitidos, sobretodo a un público tan joven e influenciable...",
        "date": "2020/10/23"
      }
    ]
  },
  {
    "datePublished": "2009-09-29",
    "description": "Un magnate inmobiliario de Nueva York se precipita hacia la muerte en una acera de Manhattan. Una esposa trofeo con un pasado sobrevive por poco a un ataque descarado. Mafiosos y magnates sin escasez de razones para matar sacan a relucir sus coartadas. Y luego, bajo las garras sofocantes de una ola de calor sin precedentes, llega otro asesinato impactante y un giro brusco en un viaje tenso hacia los pequeños y sucios secretos de los ricos. Secretos que resultan fatales. Secretos que yacen ocultos en la oscuridad hasta que un detective de la policía de Nueva York enciende una luz. La sensación de misterio Richard Castle, autor de éxitos de taquilla de las novelas de Derrick Storm más vendidas, presenta a su nuevo personaje, la detective de homicidios de la policía de Nueva York, Nikki Heat. Dura, sexy y profesional, Nikki Heat siente pasión por la justicia mientras dirige uno de los mejores escuadrones de homicidios de la ciudad de Nueva York. Se enfrenta a un desafío inesperado cuando el comisionado asigna al periodista de la revista superestrella Jameson Rook para que la acompañe en la investigación de un artículo sobre New York's Finest. Rook, ganador del premio Pulitzer, es tan problemático como guapo. Sus bromas e intromisiones no son sus únicos problemas. Mientras trabaja para desentrañar los secretos del magnate inmobiliario asesinado, también debe enfrentarse a la chispa que los une. El llamado calor.",
    "genre": "Acción",
    "author": "Richard Castle",
    "inLanguage": "en-ES",
    "isbn": "9781401323820",
    "name": "Heat Wave",
    "numberOfPages": "208",
    "publisher": {
      "@type": "Organization",
      "name": "Hyperion"
    },
    "image": [
      {
        "@type": "ImageObject",
        "name": "https://biblioteca-coll.netlify.app/images/libros/heatwave.png"
      }
    ],
    "contadores": {
      "favorito": "false"
    },
    "coments": [
      {
        "nickname": "Cait",
        "comment": "Me parece super bien por lo que lucha la protagonista y empodera a la mujer 10/10.",
        "date": "2020/10/22"
      },
      {
        "nickname": "Vi",
        "comment": "A mi novia le encantan este tipo de novelas, espero que a vosotros os gusten tanto como a ella.",
        "date": "2020/10/23"
      }
    ]
  }

]